{"keras_version": "2.0.5", "config": [{"config": {"output_dim": 32, "batch_input_shape": [null, null], "embeddings_regularizer": null, "embeddings_constraint": null, "input_length": null, "embeddings_initializer": {"config": {"maxval": 0.05, "minval": -0.05, "seed": null}, "class_name": "RandomUniform"}, "input_dim": 52, "mask_zero": false, "trainable": true, "activity_regularizer": null, "name": "embedding_1", "dtype": "int32"}, "class_name": "Embedding"}, {"config": {"unroll": false, "dropout": 0.2, "bias_regularizer": null, "recurrent_dropout": 0.2, "recurrent_regularizer": null, "unit_forget_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "activation": "tanh", "stateful": false, "kernel_regularizer": null, "bias_constraint": null, "return_state": false, "use_bias": true, "units": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "recurrent_constraint": null, "kernel_constraint": null, "go_backwards": false, "name": "lstm_1", "implementation": 0, "return_sequences": false}, "class_name": "LSTM"}, {"config": {"activity_regularizer": null, "units": 3, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "activation": "softmax", "kernel_constraint": null, "name": "dense_1"}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}