{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.5", "config": [{"class_name": "Embedding", "config": {"input_length": null, "embeddings_regularizer": null, "trainable": true, "dtype": "int32", "input_dim": 52, "embeddings_constraint": null, "batch_input_shape": [null, null], "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "mask_zero": false, "activity_regularizer": null, "output_dim": 32, "name": "embedding_1"}}, {"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "go_backwards": false, "recurrent_constraint": null, "unit_forget_bias": true, "unroll": false, "activity_regularizer": null, "activation": "tanh", "recurrent_dropout": 0.2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "lstm_1", "stateful": false, "kernel_regularizer": null, "units": 32, "return_state": false, "use_bias": true, "implementation": 0, "return_sequences": false, "dropout": 0.2, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "units": 3, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "sigmoid", "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}}]}